tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
uint32_t readCycleMaskFromForm(uint8_t cycleDays) {
    uint32_t mask = 0;
    if (Esp32BaseWeb::hasParam("cycle_mask")) {
        uint32_t value = 0;
        if (readU32Param("cycle_mask", &value)) {
            mask = value;
        }
    }
    for (uint8_t i = 0; i < cycleDays; ++i) {
        char name[8];
        snprintf(name, sizeof(name), "d%u", static_cast<unsigned>(i));
        if (Esp32BaseWeb::hasParam(name)) {
            mask |= (1UL << i);
        }
    }
    return mask == 0 ? 0x01 : mask;
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint16_t raw = 0;
    const uint8_t index = (Esp32BaseWeb::hasParam("edit") && readUIntParam("edit", &raw) && raw < PlanStore::MaxPlans) ? static_cast<uint8_t>(raw) : 0;
    const PlanStore::Plan& plan = PlanStore::get(index);
    sendHeader("编辑计划", "page-form");
    writePageHead("编辑计划", "编辑单个计划的固定配置，保存后用于后续自动浇水。");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/plans' data-confirm='确认保存计划？'><input type='hidden' name='index' value='");
    writeUInt(index);
    Esp32BaseWeb::sendChunk("'><section class='grid'><div class='panel span-12'><div class='panel-titlebar'><h2>第 ");
    writeUInt(plan.roadId);
    Esp32BaseWeb::sendChunk(" 路 / 计划 ");
    writeUInt(plan.slotIndex + 1);
    Esp32BaseWeb::sendChunk("</h2><a class='button secondary' href='/irrigation/plan-config'>返回计划配置</a></div></div><div class='panel span-12'><h2>计划状态</h2><div class='field-grid'><div class='field'><label>启用状态</label><select name='enabled'><option value='0'");
    writeSelected(!plan.enabled);
    Esp32BaseWeb::sendChunk(">停用</option><option value='1'");
    writeSelected(plan.enabled);
    Esp32BaseWeb::sendChunk(">启用</option></select></div><div class='field'><label>执行时间</label><input name='time' type='time' value='");
    writeMinuteOfDay(plan.minuteOfDay);
    Esp32BaseWeb::sendChunk("'></div><div class='field'><label>水路</label><input disabled value='第 ");
    writeUInt(plan.roadId);
    Esp32BaseWeb::sendChunk(" 路 ");
    writeRoadDisplayName(plan.roadId);
    Esp32BaseWeb::sendChunk("'></div><div class='field'><label>浇水时长</label><span class='input-suffix'><input name='duration_min' type='number' min='1' max='240' value='");
    writeMinutesFromSeconds(plan.durationSec);
    Esp32BaseWeb::sendChunk("'><em>分钟</em></span></div></div></div>");
    const uint32_t editCycleStartYmd = cycleStartYmdForEdit(plan);
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>循环规则</h2><div class='field-grid'><div class='field'><label>循环天数</label><input id='cycleDays' name='cycle_days' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("'></div><div class='field'><label>循环开始日期</label><input name='cycle_start_ymd' type='date' value='");
    writeYmd(editCycleStartYmd);
    Esp32BaseWeb::sendChunk("'></div></div><h3>循环执行日</h3><div class='check-grid' id='cycleDayList'>");
    for (uint8_t i = 0; i < 30; ++i) {
        Esp32BaseWeb::sendChunk("<label class='check-item' data-day='");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("'><input type='checkbox' name='d");
        writeUInt(i);
        Esp32BaseWeb::sendChunk("'");
        writeChecked((plan.cycleMask & (1UL << i)) != 0);
        Esp32BaseWeb::sendChunk("> 第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天</label>");
    }
    Esp32BaseWeb::sendChunk("</div><p class='note'>计划只使用循环规则：每天浇水是 1 天循环；浇 2 天停 1 天是 3 天循环并执行第 1、2 天；每周固定日期是 7 天循环。</p></div><div class='panel span-12'><div class='actions form-actions'><a class='button secondary' href='/irrigation/plan-config'>返回计划配置</a><button>保存计划</button></div></div></section></form><script>(function(){var n=document.getElementById('cycleDays');var list=document.getElementById('cycleDayList');function sync(){var max=Math.max(1,Math.min(30,parseInt(n.value||'1',10)||1));n.value=max;list.querySelectorAll('[data-day]').forEach(function(item){var show=parseInt(item.dataset.day,10)<=max;item.style.display=show?'flex':'none';if(!show){var c=item.querySelector('input');if(c)c.checked=false;}});}if(n&&list){n.addEventListener('input',sync);sync();}})();</script>");
    sendFooter();
}

void writeSettingRow(const char* key, const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<div class='setting-row'><span>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</strong><button type='button' class='secondary' data-setting-open='setting-");
    Esp32BaseWeb::writeHtmlEscaped(key);
    Esp32BaseWeb::sendChunk("'>修改</button></div>");
}

void writeSettingReadOnlyRow(const char* label, const char* value, const char* note) {
    Esp32BaseWeb::sendChunk("<div class='setting-row'><span>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</strong><small class='note'>");
    Esp32BaseWeb::writeHtmlEscaped(note);
    Esp32BaseWeb::sendChunk("</small></div>");
}

void writeSettingsModalScript() {
    Esp32BaseWeb::sendChunk(
        "<script>(function(){"
        "function closeAll(){document.querySelectorAll('.modal').forEach(function(m){m.hidden=true;});}"
        "document.addEventListener('click',function(e){"
        "var open=e.target.closest('[data-setting-open]');"
        "if(open){var m=document.getElementById(open.getAttribute('data-setting-open'));if(m){m.hidden=false;var f=m.querySelector('input,select,button');if(f)f.focus();}return;}"
        "if(e.target.matches('[data-setting-close]')||e.target.classList.contains('modal'))closeAll();"
        "});"
        "document.addEventListener('keydown',function(e){if(e.key==='Escape')closeAll();});"
        "})();</script>");
}

void writeSettingEditModal(const char* edit, const char* title, const char* currentValue) {
    if (!edit || edit[0] == '\0') {
        return;
    }
    const SettingsStore::Settings& s = SettingsStore::current();
    Esp32BaseWeb::sendChunk("<div class='modal' id='setting-");
    Esp32BaseWeb::writeHtmlEscaped(edit);
    Esp32BaseWeb::sendChunk("' hidden><div class='modal-card' role='dialog' aria-modal='true'><h2>修改参数</h2><p class='modal-value'>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("：");
    Esp32BaseWeb::writeHtmlEscaped(currentValue);
    Esp32BaseWeb::sendChunk("</p><form method='post' action='/irrigation/settings/config' data-confirm='确认保存设置？'><div class='field-grid'>");
    uint8_t road = parseRoadFromKey(edit, "_enabled");
    if (road > 0) {
        Esp32BaseWeb::sendChunk("<input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><div class='field'><label>启用状态</label><select name='enabled'><option value='1'");
        writeSelected(SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">已启用</option><option value='0'");
        writeSelected(!SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">未启用</option></select></div>");
    } else if ((road = parseRoadFromKey(edit, "_name")) > 0) {
        Esp32BaseWeb::sendChunk("<div class='field'><label>名称</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_name' maxlength='11' value='");
        Esp32BaseWeb::writeHtmlEscaped(s.roads[road - 1].name);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strncmp(edit, "quick_r", 7) == 0 && edit[7] >= '1' && edit[7] <= '4' && strcmp(edit + 8, "_min") == 0) {
        road = static_cast<uint8_t>(edit[7] - '0');
        Esp32BaseWeb::sendChunk("<div class='field'><label>默认时长（分钟）</label><input name='quick_r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(s.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if ((road = parseRoadFromKey(edit, "_pulse_per_liter")) > 0) {
        Esp32BaseWeb::sendChunk("<div class='field'><label>每升脉冲</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_pulse_per_liter' type='number' min='1' max='10000' value='");
        writeUInt(s.roads[road - 1].pulsePerLiter);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if ((road = parseRoadFromKey(edit, "_calibration_x1000")) > 0) {
        Esp32BaseWeb::sendChunk("<div class='field'><label>校准系数</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_calibration_x1000' type='number' min='100' max='10000' value='");
        writeUInt(s.roads[road - 1].calibrationX1000);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strcmp(edit, "flow_no_pulse_timeout_s") == 0 || strcmp(edit, "idle_leak_window_s") == 0 || strcmp(edit, "idle_leak_pulse_threshold") == 0) {
        uint16_t current = s.flowNoPulseTimeoutSec;
        const char* label = "无脉冲超时";
        uint16_t max = 60;
        if (strcmp(edit, "idle_leak_window_s") == 0) {
            current = s.idleLeakWindowSec;
            label = "漏水窗口";
        } else if (strcmp(edit, "idle_leak_pulse_threshold") == 0) {
            current = s.idleLeakPulseThreshold;
            label = "漏水脉冲阈值";
            max = 100;
        }
        Esp32BaseWeb::sendChunk("<div class='field'><label>");
        Esp32BaseWeb::writeHtmlEscaped(label);
        Esp32BaseWeb::sendChunk("</label><input name='");
        Esp32BaseWeb::writeHtmlEscaped(edit);
        Esp32BaseWeb::sendChunk("' type='number' min='1' max='");
        writeUInt(max);
        Esp32BaseWeb::sendChunk("' value='");
        writeUInt(current);
        Esp32BaseWeb::sendChunk("'></div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><button type='button' class='secondary' data-setting-close>取消</button><button>保存</button></div></form></div></div>");
}

void writeSettingEditModals() {
    const SettingsStore::Settings& s = SettingsStore::current();
    char value[32];
    char key[32];
    char title[32];
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        const SettingsStore::RoadConfig& r = s.roads[road - 1];
        snprintf(key, sizeof(key), "r%u_enabled", static_cast<unsigned>(road));
        snprintf(title, sizeof(title), "第 %u 路启用状态", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%s", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        writeSettingEditModal(key, title, value);
        snprintf(key, sizeof(key), "r%u_name", static_cast<unsigned>(road));
        snprintf(title, sizeof(title), "第 %u 路名称", static_cast<unsigned>(road));
        writeSettingEditModal(key, title, r.name);
        snprintf(key, sizeof(key), "quick_r%u_min", static_cast<unsigned>(road));
        snprintf(title, sizeof(title), "第 %u 路默认时长", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        writeSettingEditModal(key, title, value);
        snprintf(key, sizeof(key), "r%u_pulse_per_liter", static_cast<unsigned>(road));
        snprintf(title, sizeof(title), "第 %u 路每升脉冲", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u pulse/L", static_cast<unsigned>(r.pulsePerLiter));
        writeSettingEditModal(key, title, value);
        snprintf(key, sizeof(key), "r%u_calibration_x1000", static_cast<unsigned>(road));
        snprintf(title, sizeof(title), "第 %u 路校准系数", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(r.calibrationX1000));
        writeSettingEditModal(key, title, value);
    }
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
    writeSettingEditModal("flow_no_pulse_timeout_s", "无脉冲超时", value);
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
    writeSettingEditModal("idle_leak_window_s", "漏水窗口", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
    writeSettingEditModal("idle_leak_pulse_threshold", "漏水脉冲阈值", value);
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const SettingsStore::Settings& s = SettingsStore::current();
    sendHeader("灌溉设置", "page-settings");
    writePageHead("灌溉设置", "查看和修改水路、流量计量、默认浇水和安全检测参数。");
    char value[32];
    Esp32BaseWeb::sendChunk("<section class='grid'>");
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>灌溉设置</h2><div class='setting-list'>");
    snprintf(value, sizeof(value), "%u 路", static_cast<unsigned>(SettingsStore::enabledRoads()));
    writeSettingReadOnlyRow("已启用路数", value, "由各路启用状态计算");
    writeSettingReadOnlyRow("阀门 PWM", "启动 5 秒后 70%", "固定硬件策略");
    Esp32BaseWeb::sendChunk("</div></div>");
    char key[32];
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        const SettingsStore::RoadConfig& r = s.roads[road - 1];
        Esp32BaseWeb::sendChunk("<div class='panel span-6'><h2>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路配置</h2><div class='setting-list'>");
        snprintf(key, sizeof(key), "r%u_enabled", static_cast<unsigned>(road));
        writeSettingRow(key, "启用状态", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        snprintf(key, sizeof(key), "r%u_name", static_cast<unsigned>(road));
        writeSettingRow(key, "名称", r.name);
        writeSettingReadOnlyRow("阀门引脚", valvePinName(road), "固定硬件配置");
        writeSettingReadOnlyRow("流量引脚", flowPinName(road), "固定硬件配置");
        snprintf(key, sizeof(key), "quick_r%u_min", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        writeSettingRow(key, "默认时长", value);
        snprintf(key, sizeof(key), "r%u_pulse_per_liter", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u pulse/L", static_cast<unsigned>(r.pulsePerLiter));
        writeSettingRow(key, "每升脉冲", value);
        snprintf(key, sizeof(key), "r%u_calibration_x1000", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(r.calibrationX1000));
        writeSettingRow(key, "校准系数", value);
        Esp32BaseWeb::sendChunk("</div></div>");
    }
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>水流检测</h2><div class='setting-list'>");
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
    writeSettingRow("flow_no_pulse_timeout_s", "无脉冲超时", value);
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
    writeSettingRow("idle_leak_window_s", "漏水窗口", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
    writeSettingRow("idle_leak_pulse_threshold", "漏水脉冲阈值", value);
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::sendChunk("</section>");
    writeSettingEditModals();
    writeSettingsModalScript();
    sendFooter();
}

void handleDataPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("历史记录", "page-table");
    writePageHead("历史记录", "查看每一次浇水任务的来源、停止来源、执行结果和实际水量。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><div class='panel-titlebar'><h2>浇水记录</h2></div><div class='table-wrap'><table><thead><tr><th>ID</th><th>路</th><th>任务</th><th>启动来源</th><th>停止来源</th><th>结果</th><th>目标</th><th>实际</th><th>水量</th></tr></thead><tbody>");
    auto recordCb = [](const RecordStore::Record& record, void*) {
        const uint32_t actualSec = record.endedMs >= record.startedMs && record.startedMs > 0 ? (record.endedMs - record.startedMs) / 1000UL : 0;
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(record.id);
        Esp32BaseWeb::sendChunk("</td><td>第 ");
        writeUInt(record.roadId);
        Esp32BaseWeb::sendChunk(" 路</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::taskTypeName(static_cast<RecordStore::TaskType>(record.taskType)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.startSource)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.stopSource)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::resultName(static_cast<RecordStore::Result>(record.result)));
        Esp32BaseWeb::sendChunk("</td><td>");
        writeMinutesFromSeconds(record.targetSec);
        Esp32BaseWeb::sendChunk(" 分钟</td><td>");
        writeUInt(actualSec);
        Esp32BaseWeb::sendChunk(" 秒</td><td>");
        writeLitersFromMl(record.estimatedMilliliters);
        Esp32BaseWeb::sendChunk("</td></tr>");
    };
    (void)RecordStore::readLatest(0, 10, recordCb, nullptr);
    Esp32BaseWeb::sendChunk("</tbody></table></div></div></section>");
    sendFooter();
}

void writeSettingsJson() {
    const SettingsStore::Settings& s = SettingsStore::current();
    Esp32BaseWeb::sendChunk("\"settings\":{\"enabled_roads\":");
    writeUInt(SettingsStore::enabledRoads());
    Esp32BaseWeb::sendChunk(",\"road_enabled_mask\":");
    writeUInt(SettingsStore::roadEnabledMask());
    Esp32BaseWeb::sendChunk(",\"flow_no_pulse_timeout_s\":");
    writeUInt(s.flowNoPulseTimeoutSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_window_s\":");
    writeUInt(s.idleLeakWindowSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_pulse_threshold\":");
    writeUInt(s.idleLeakPulseThreshold);
    Esp32BaseWeb::sendChunk(",\"roads\":{");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        if (road > 1) Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::sendChunk("\"r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("\":{\"enabled\":");
        writeBool(SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(",\"name\":\"");
        Esp32BaseWeb::writeJsonEscaped(s.roads[road - 1].name);
        Esp32BaseWeb::sendChunk("\",\"valve_pin\":\"");
        Esp32BaseWeb::writeJsonEscaped(valvePinName(road));
        Esp32BaseWeb::sendChunk("\",\"flow_pin\":\"");
        Esp32BaseWeb::writeJsonEscaped(flowPinName(road));
        Esp32BaseWeb::sendChunk("\",\"quick_duration_sec\":");
        writeUInt(s.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
        writeUInt(s.roads[road - 1].pulsePerLiter);
        Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
        writeUInt(s.roads[road - 1].calibrationX1000);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("}}");
}

