tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeRoadJson(uint8_t road) {
    const WateringSession::RoadStatus& st = WateringSession::roadStatus(road);
    const uint32_t pulses = st.lastPulseCount >= st.startedPulseCount ? st.lastPulseCount - st.startedPulseCount : 0;
    Esp32BaseWeb::sendChunk("{\"enabled\":");
    writeBool(SettingsStore::isRoadEnabled(road));
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(WateringSession::roadStateName(st.state));
    Esp32BaseWeb::sendChunk("\",\"target_sec\":");
    writeUInt(st.targetSec);
    Esp32BaseWeb::sendChunk(",\"estimated_ml\":");
    writeUInt(SettingsStore::estimateMilliliters(road, pulses));
    Esp32BaseWeb::sendChunk(",\"flow_l_min\":");
    writeFixed2FromX100(flowRateLiterPerMinuteX100(road));
    Esp32BaseWeb::sendChunk(",\"valve_open\":");
    writeBool(ValveController::isOpen(road));
    Esp32BaseWeb::sendChunk("}");
}

void writeWateringJson() {
    Esp32BaseWeb::sendChunk("\"watering\":{\"active\":");
    writeBool(WateringSession::isActive());
    Esp32BaseWeb::sendChunk(",\"roads\":{");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        if (road > 1) Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::sendChunk("\"r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("\":");
        writeRoadJson(road);
    }
    Esp32BaseWeb::sendChunk("}}");
}

void writePlanJson(uint8_t index, const PlanStore::Plan& p) {
    Esp32BaseWeb::sendChunk("{\"index\":");
    writeUInt(index);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    writeBool(p.enabled);
    Esp32BaseWeb::sendChunk(",\"minute_of_day\":");
    writeUInt(p.minuteOfDay);
    Esp32BaseWeb::sendChunk(",\"road_id\":");
    writeUInt(p.roadId);
    Esp32BaseWeb::sendChunk(",\"slot_index\":");
    writeUInt(p.slotIndex);
    Esp32BaseWeb::sendChunk(",\"duration_sec\":");
    writeUInt(p.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycle_days\":");
    writeUInt(p.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycle_mask\":");
    writeUInt(p.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycle_start_ymd\":");
    writeUInt(p.cycleStartYmd);
    Esp32BaseWeb::sendChunk(",\"last_run_ymd\":");
    writeUInt(p.lastRunYmd);
    Esp32BaseWeb::sendChunk("}");
}

bool writeRecentPlanJson(uint8_t index, const char* label, int8_t offset, uint32_t ymd, bool* first) {
    const PlanStore::Plan& plan = PlanStore::get(index);
    const bool skipped = PlanSkipStore::isSkipped(index, ymd);
    const bool handled = plan.lastRunYmd == ymd;
    PlanResultStore::Result planResult = PlanResultStore::RESULT_NONE;
    const bool hasPlanResult = PlanResultStore::getResult(index, ymd, &planResult);
    const WateringSession::RoadStatus& roadStatus = WateringSession::roadStatus(plan.roadId);
    const uint16_t nowMinute = currentMinuteOfDay();
    const bool running = offset == 0 && plan.minuteOfDay == nowMinute && WateringSession::isRoadActive(plan.roadId) && roadStatus.taskType == RecordStore::TASK_PLAN && roadStatus.planSlot == plan.slotIndex;
    const bool shouldRun = plan.enabled && PlanStore::shouldRunOnDate(plan, ymd);
    const bool executable = hasEffectivePlanRoad(plan);
    if (!plan.enabled && !handled && !running) return false;
    if (plan.enabled && !shouldRun) return false;
    const bool pastToday = offset == 0 && plan.minuteOfDay < nowMinute;
    const char* status = running ? "running" : (hasPlanResult ? PlanResultStore::resultName(planResult) : (handled ? "handled" : (skipped ? "skipped" : (!executable ? "not_executable" : (pastToday ? "missed" : "pending")))));
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    Esp32BaseWeb::sendChunk("{\"date_label\":\"");
    Esp32BaseWeb::writeJsonEscaped(label);
    Esp32BaseWeb::sendChunk("\",\"ymd\":");
    writeUInt(ymd);
    Esp32BaseWeb::sendChunk(",\"index\":");
    writeUInt(index);
    Esp32BaseWeb::sendChunk(",\"road_id\":");
    writeUInt(plan.roadId);
    Esp32BaseWeb::sendChunk(",\"slot_index\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"minute_of_day\":");
    writeUInt(plan.minuteOfDay);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"should_run\":");
    writeBool(shouldRun);
    Esp32BaseWeb::sendChunk(",\"skipped\":");
    writeBool(skipped);
    Esp32BaseWeb::sendChunk(",\"handled\":");
    writeBool(handled);
    Esp32BaseWeb::sendChunk(",\"running\":");
    writeBool(running);
    Esp32BaseWeb::sendChunk(",\"executable\":");
    writeBool(executable);
    Esp32BaseWeb::sendChunk(",\"status\":\"");
    Esp32BaseWeb::writeJsonEscaped(status);
    Esp32BaseWeb::sendChunk("\",\"plan_result\":\"");
    Esp32BaseWeb::writeJsonEscaped(PlanResultStore::resultName(planResult));
    Esp32BaseWeb::sendChunk("\",\"plan_result_label\":\"");
    Esp32BaseWeb::writeJsonEscaped(PlanResultStore::resultLabel(planResult));
    Esp32BaseWeb::sendChunk("\"}");
    return true;
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    char text[32];
    beginJson();
    Esp32BaseWeb::sendChunk("{\"firmware\":{\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareName());
    Esp32BaseWeb::sendChunk("\",\"version\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
    Esp32BaseWeb::sendChunk("\"},\"wifi\":{\"connected\":");
#if ESP32BASE_ENABLE_WIFI
    writeBool(Esp32BaseWiFi::isConnected());
    Esp32BaseWeb::sendChunk(",\"ssid\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseWiFi::ssid());
    Esp32BaseWeb::sendChunk("\",\"rssi\":");
    writeInt(static_cast<int32_t>(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::sendChunk(",\"ip\":\"");
    char ip[24] = "";
    (void)Esp32BaseWiFi::ip(ip, sizeof(ip));
    Esp32BaseWeb::writeJsonEscaped(ip);
#else
    writeBool(false);
    Esp32BaseWeb::sendChunk(",\"ssid\":\"\",\"rssi\":0,\"ip\":\"");
#endif
    Esp32BaseWeb::sendChunk("\"},\"time\":{\"synced\":");
    writeBool(Esp32BaseNtp::isTimeSynced());
    Esp32BaseWeb::sendChunk(",\"current\":\"");
    if (!Esp32BaseNtp::formatTime(text, sizeof(text), "%Y-%m-%d %H:%M:%S")) text[0] = '\0';
    Esp32BaseWeb::writeJsonEscaped(text);
    Esp32BaseWeb::sendChunk("\"},\"records\":{\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk("},\"events\":{\"count\":");
    writeUInt(EventStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(EventStore::capacity());
    Esp32BaseWeb::sendChunk("},");
    writeSettingsJson();
    Esp32BaseWeb::sendChunk(",");
    writeWateringJson();
    Esp32BaseWeb::sendChunk("}");
    endJson();
}

bool rejectIfFactoryResetPending() {
    if (!MaintenanceService::factoryResetPending()) {
        return false;
    }
    Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"factory_reset_pending\"}");
    return true;
}

void sendConfigError(const char* error) {
    beginJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(error ? error : "invalid_config");
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

bool saveConfigFromRequest(const char** error) {
    if (error) {
        *error = nullptr;
    }
    uint16_t value = 0;
    bool boolValue = false;
    char text[12] = "";
    bool ok = true;
    if (countConfigFields() != 1) {
        if (error) {
            *error = "one_config_field_required";
        }
        return false;
    }
    if (Esp32BaseWeb::hasParam("road")) {
        uint16_t road = 0;
        ok = readUIntParam("road", &road) && readBoolParam("enabled", &boolValue) && SettingsStore::setRoadEnabled(static_cast<uint8_t>(road), boolValue);
    } else if (Esp32BaseWeb::hasParam("flow_no_pulse_timeout_s")) {
        ok = readUIntParam("flow_no_pulse_timeout_s", &value) && value <= 60 && SettingsStore::setFlowNoPulseTimeoutSec(static_cast<uint8_t>(value));
    } else if (Esp32BaseWeb::hasParam("idle_leak_window_s")) {
        ok = readUIntParam("idle_leak_window_s", &value) && value <= 60 && SettingsStore::setIdleLeakWindowSec(static_cast<uint8_t>(value));
    } else if (Esp32BaseWeb::hasParam("idle_leak_pulse_threshold")) {
        ok = readUIntParam("idle_leak_pulse_threshold", &value) && value <= 100 && SettingsStore::setIdleLeakPulseThreshold(static_cast<uint8_t>(value));
    } else {
        ok = false;
        for (uint8_t road = 1; road <= IrrigationPins::MaxRoads && !ok; ++road) {
            char key[32];
            snprintf(key, sizeof(key), "quick_r%u_min", static_cast<unsigned>(road));
            if (Esp32BaseWeb::hasParam(key)) {
                uint16_t seconds = 0;
                ok = readDurationSecondsParam(key, &seconds) && SettingsStore::setQuickDurationSec(road, seconds);
                break;
            }
            snprintf(key, sizeof(key), "r%u_name", static_cast<unsigned>(road));
            if (Esp32BaseWeb::hasParam(key)) {
                ok = Esp32BaseWeb::getParam(key, text, sizeof(text)) && SettingsStore::setRoadName(road, text);
                break;
            }
            snprintf(key, sizeof(key), "r%u_pulse_per_liter", static_cast<unsigned>(road));
            if (Esp32BaseWeb::hasParam(key)) {
                ok = readUIntParam(key, &value) && SettingsStore::setRoadPulsePerLiter(road, value);
                break;
            }
            snprintf(key, sizeof(key), "r%u_calibration_x1000", static_cast<unsigned>(road));
            if (Esp32BaseWeb::hasParam(key)) {
                ok = readUIntParam(key, &value) && SettingsStore::setRoadCalibrationX1000(road, value);
                break;
            }
        }
    }
    if (!ok) {
        if (error) {
            *error = "invalid_config";
        }
        return false;
    }
    (void)EventStore::append(EventStore::TYPE_CONFIG_CHANGED, EventStore::SOURCE_WEB, 0, 0, SettingsStore::roadEnabledMask(), 0, "config saved");
    return true;
}

